import { defineStore } from 'pinia'
import { ref, computed } from 'vue';

export const useSymbolsStore = defineStore('symbolsStore', () => {

  const keyboards = ref([
    {
      name: '(ENG) Public',
      symbols: {
        '0': '♨', '1': '✡', '2': '✷', '3': '✥', '4': '▩', '5': '♜', '6': '♛', '7': '△', '8': '▤', '9': '▣', ' ': '%',
        'A': '▦', 'B': '✪', 'C': '✢', 'D': '✱', 'E': '▪', 'F': '✧', 'G': '✹', 'H': '✺', 'I': '▧', 'J': '▬',
        'K': '▨', 'L': '✤', 'M': '◩', 'N': '◬', 'O': '◪', 'P': '◭', 'Q': '✦', 'R': '✶', 'S': '✣', 'T': '✯',
        'U': '▢', 'V': '♚', 'W': '✰', 'X': '□', 'Y': '❅', 'Z': '▻',
        'a': '◧', 'b': '?', 'c': '▲', 'd': '◫', 'e': '♝', 'f': '◥', 'g': '♬', 'h': '♘', 'i': '♟', 'j': '♧',
        'k': '♙', 'l': '◯', 'm': '❃', 'n': '◮', 'o': '✸', 'p': '&', 'q': '♣', 'r': '!', 's': '№',
        't': '✵', 'u': '♞', 'v': '@', 'w': '✽', 'x': '✠', 'y': '✴', 'z': '∐'
      },
    },
    {
      name: '(RUS) Public',
      symbols: {
        '0': '♨', '1': '✡', '2': '✷', '3': '✥', '4': '▩', '5': '♜', '6': '♛', '7': '△', '8': '▤', '9': '▣', ' ': '%',
        'А': '▦', 'Б': '✪', 'В': '✢', 'Г': '✱', 'Д': '▪', 'Е': '✧', 'Ж': '✹', 'З': '✺', 'И': '▧', 'Й': '▬',
        'К': '▨', 'Л': '✤', 'М': '◩', 'Н': '◬', 'О': '◪', 'П': '◭', 'Р': '✦', 'С': '✶', 'Т': '✣', 'У': '✯',
        'Ф': '▢', 'Х': '♚', 'Ц': '✰', 'Ч': '□', 'Ш': '❅', 'Щ': '▻', 'Ъ': '◌', 'Ы': '✾', 'Ь': '❖', 'Э': '☆', 'Ю': '⍟', 'Я': '✵',
        'а': '◧', 'б': '?', 'в': '▲', 'г': '◫', 'д': '♝', 'е': '◥', 'ё': '♬', 'ж': '♘', 'з': '♟', 'и': '♧',
        'й': '♙', 'к': '◯', 'л': '❃', 'м': '◮', 'н': '✸', 'о': '&', 'п': '♣', 'р': '!', 'с': '№',
        'т': 'α', 'у': '♞', 'ф': '@', 'х': '✽', 'ц': '✠', 'ч': '✴', 'ш': 'β', 'щ': 'ε', 'ъ': 'ζ', 'ы': 'ψ', 'ь': 'σ', 'э': 'η', 'ю': 'Ξ', 'я': 'Λ',
        ',': '⸘', '.': '¼', '!': '©', '?': '¶', ')': '~', '(': '÷', '-': '™'
      },
    },
  ]);
  const currentKeyboard = ref('(ENG) Public');
  const onInputFlag = ref(false);
  const lang = ref('en-US');
  const symbols = ref({
    '┐': '┐', '└': '└', '┴': '┴', '┌': '┌', '─': '─', '│': '│', '┘': '┘', '├': '├', '┤': '┤', '┬': '┬',
    '▒': '▒', '▓': '▓', '█': '█', '░': '░', '▀': '▀', '▄': '▄', '■': '■', '□': '□', '▲': '▲', '▼': '▼',
    '◆': '◆', '○': '○', '●': '●', '◐': '◐', '◑': '◑', '◒': '◒', '◓': '◓', '◔': '◔', '◕': '◕', '⌂': '⌂',
    '★': '★', '☆': '☆', '✪': '✪', '✽': '✽', '✦': '✦', '✯': '✯', '✰': '✰', '✶': '✶', '✷': '✷', '✵': '✵',
    '✹': '✹', '✺': '✺', '✸': '✸', '✻': '✻', '✠': '✠', '✡': '✡', '✢': '✢', '✣': '✣', '✤': '✤', '✥': '✥',
    '⚙': '⚙', '⚚': '⚚', '⚛': '⚛', '⚜': '⚜', '⚝': '⚝', '⚞': '⚞', '⚟': '⚟', '⚠': '⚠', 'œ': 'œ', '⚢': '⚢',
    '⚣': '⚣', '⚤': '⚤', '⚥': '⚥', '⚦': '⚦', '⚧': '⚧', '⚨': '⚨', '⚩': '⚩', 'Š': 'Š', 'Œ': 'Œ', '⚬': '⚬',
    '⚭': '⚭', '⚮': '⚮', '⚯': '⚯', '⚰': '⚰', '⚱': '⚱', '⚲': '⚲', '⚳': '⚳', '⚴': '⚴', '⚵': '⚵', '⚶': '⚶',
    '⚷': '⚷', '⚸': '⚸', '⚹': '⚹', '⚺': '⚺', '⚻': '⚻', '⚼': '⚼', '‡': '‡', '‰': '‰', '⚿': '⚿'
  })

  const getKeyboardByName = computed(() => {
    return (name) => {
      return keyboards.value.find(el => el.name === name).symbols;
    }
  });
  const onInput = computed(() => {
    return (flagStatus) => {
      return onInputFlag.value = flagStatus
    }
  });

  const saveNewKeyboard = (newKeyboard, newKeyboardName) => {
    keyboards.value.push({
      name: newKeyboardName,
      symbols: newKeyboard
    });
  };
  const updateKeyboard = (updatedKeyboard, keyboardName) => {
    keyboards.value.find(el => el.name === keyboardName).symbols = updatedKeyboard;
  }

  return {
    keyboards, currentKeyboard, onInputFlag, lang, symbols, getKeyboardByName,
    onInput, saveNewKeyboard, updateKeyboard
  }
})